In [3]:
import pandas as pd
import numpy as np

In [4]:
path = "C:/Users/User/Downloads/FoodBalanceSheets_E_Africa_NOFLAG (3).csv"

In [5]:
df = pd.read_csv(path, encoding='latin-1')
df.head(3)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.0,40551.0,41389.0,42228.0
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.0,0.0,0.0,0.0
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.0,3379.0,3372.0,3341.0,3322.0

# Question 1
## What is the total sum of Animal Fat produced in 2014 and 2017 respectively?

In [6]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [8]:
animal_fat_val = df[['Item','Y2014', 'Y2017']]
animal_fat_val

                Item     Y2014     Y2017
0         Population  38924.00  41389.00
1         Population      0.00      0.00
2        Grand Total   3377.00   3341.00
3        Grand Total     94.90     92.82
4        Grand Total     80.06     80.19
...              ...       ...       ...
60938  Miscellaneous     42.00     19.00
60939  Miscellaneous      3.06      1.33
60940  Miscellaneous      3.00      1.00
60941  Miscellaneous      0.10      0.04
60942  Miscellaneous      0.04      0.02

[60943 rows x 3 columns]

In [34]:
af = animal_fat_val["Item"] == "Animal fats"
new_af = animal_fat_val[af]

In [35]:
for i in new_af.columns[1:]:
    year_sum = f" the sum of year {i} is {new_af[i].sum()}"
    print(year_sum)

 the sum of year Y2014 is 209460.54
 the sum of year Y2017 is 269617.53

# Or

In [11]:
animal_ft = df.groupby("Item")[["Y2014", "Y2017"]].sum().reset_index()
animal_ft.query("Item == 'Animal fats'")

          Item      Y2014      Y2017
3  Animal fats  209460.54  269617.53

# Question 2
## What is the mean and standard deviation across the whole dataset for the year 2015 to 3 decimal places?

In [12]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [13]:
working_df = df[['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2015']]
working_df

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2015
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,39728.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3379.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.35
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,79.36
...,...,...,...,...,...,...,...,...
60938,181,Zimbabwe,2899,Miscellaneous,5142,Food,1000 tonnes,46.00
60939,181,Zimbabwe,2899,Miscellaneous,645,Food supply quantity (kg/capita/yr),kg,3.33
60940,181,Zimbabwe,2899,Miscellaneous,664,Food supply (kcal/capita/day),kcal/capita/day,4.00
60941,181,Zimbabwe,2899,Miscellaneous,674,Protein supply quantity (g/capita/day),g/capita/day,0.11
60942,181,Zimbabwe,2899,Miscellaneous,684,Fat supply quantity (g/capita/day),g/capita/day,0.05

In [14]:
round(working_df.describe(), 3)

       Area Code  Item Code  Element Code       Y2015
count  60943.000  60943.000     60943.000   59395.000
mean     134.266   2687.177      3814.856     135.236
std       72.606    146.056      2212.007    1603.404
min        4.000   2501.000       511.000   -3161.000
25%       74.000   2562.000       684.000       0.000
50%      136.000   2630.000      5142.000       0.080
75%      195.000   2775.000      5511.000       8.460
max      276.000   2961.000      5911.000  181137.000

# Or

In [15]:
mean_df =round(df["Y2015"].mean(),3)
mean_df

135.236

In [16]:
std_df = round(df["Y2015"].std(),3)
std_df
print( mean_df,  std_df)

135.236 1603.404

# Question 3
## What is the total number and percentage of missing data in 2016 to 2 decimal places?

In [17]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [18]:
query_df = df['Y2016']
query_df

0        40551.00
1            0.00
2         3372.00
3           94.72
4           77.40
           ...
60938       33.00
60939        2.35
60940        3.00
60941        0.08
60942        0.03
Name: Y2016, Length: 60943, dtype: float64

In [19]:
total_missing = query_df.isna().sum()
per = round(total_missing*100 / len(df), 2)
print(total_missing, per)

1535 2.52

# Question 4
## Which year had the highest correlation with ‘Element Code’?

In [20]:
df.head(3)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.0,40551.0,41389.0,42228.0
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.0,0.0,0.0,0.0
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.0,3379.0,3372.0,3341.0,3322.0

In [38]:
dff=round(df.corr().reset_index(),4)
dff

,index,Area Code,Item Code,Element Code,Y2014,Y2015,Y2016,Y2017,Y2018
0,Area Code,1.0000,-0.0052,-0.0002,0.0062,0.0055,0.0052,0.0050,0.0057
1,Item Code,-0.0052,1.0000,-0.0247,0.0217,0.0209,0.0201,0.0215,0.0213
2,Element Code,-0.0002,-0.0247,1.0000,0.0245,0.0239,0.0234,0.0243,0.0243
3,Y2014,0.0062,0.0217,0.0245,1.0000,0.9946,0.9961,0.9952,0.9949
4,Y2015,0.0055,0.0209,0.0239,0.9946,1.0000,0.9957,0.9880,0.9882
5,Y2016,0.0052,0.0201,0.0234,0.9961,0.9957,1.0000,0.9928,0.9928
6,Y2017,0.0050,0.0215,0.0243,0.9952,0.9880,0.9928,1.0000,0.9981
7,Y2018,0.0057,0.0213,0.0243,0.9949,0.9882,0.9928,0.9981,1.0000

In [50]:
datap = np.array(dff.iloc[2][4:])
datax = dff.columns[4:]

a = pd.DataFrame(datap, columns=["correlation_against_element"])
b = pd.DataFrame(datax, columns=["column_def"])
corr_df = pd.concat([a, b], axis=1)
corr_df[corr_df["correlation_against_element"]==corr_df["correlation_against_element"].max()]

  correlation_against_element column_def
0                      0.0245      Y2014

# Question 5
## What year has the highest sum of Import Quantity?

Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question

In [23]:
df.head(3)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.0,40551.0,41389.0,42228.0
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.0,0.0,0.0,0.0
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.0,3379.0,3372.0,3341.0,3322.0

In [24]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [25]:
import_qty = df[['Element', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']]
import_qty = import_qty.query("Element == 'Import Quantity'")
result = import_qty.groupby("Element")[['Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018']].sum()
result=result
result_transposed = result.T # or result.transpose()\
result_transposed
result_transposed.sort_values(by= "Import Quantity", ascending=False, inplace=False)

# cols = df_res.columns
# df_val = np.array(df_res.iloc[0])
# a = cols[1:]
# b = df_val[1:]

# year_val = pd.DataFrame(a, columns =["year"])
# qty_val = pd.DataFrame(b, columns=["qty"])
# new_pd = pd.concat([year_val, qty_val], axis = 1)
# max_qty = new_pd["qty"].max()
# new_pd[new_pd["qty"] == max_qty]

Element  Import Quantity
Y2017          294559.09
Y2018          287997.09
Y2016          286582.78
Y2014          274144.48
Y2015          267018.46

# Question 6
## What is the total number of the sum of Production in 2014?

Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question

In [26]:
sum_df = df.groupby("Element")["Y2014"].sum()
sum_df

Element
Domestic supply quantity                  1996716.35
Export Quantity                            150020.64
Fat supply quantity (g/capita/day)          10225.56
Feed                                       216927.89
Food                                      1212332.49
Food supply (kcal/capita/day)              454257.00
Food supply quantity (kg/capita/yr)         49650.63
Import Quantity                            274144.48
Losses                                     153223.00
Other uses (non-food)                       78718.13
Processing                                 282923.00
Production                                1931287.75
Protein supply quantity (g/capita/day)      11836.46
Residuals                                   30149.00
Seed                                        21922.92
Stock Variation                             58749.83
Total Population - Both sexes             1031585.00
Tourist consumption                           416.00
Name: Y2014, dtype: float64

# Or

In [27]:
dff = df[["Element", "Y2014"]]
prod_df = dff.query("Element == 'Production'")
prod_df.sum()

Element    ProductionProductionProductionProductionProduc...
Y2014                                             1931287.75
dtype: object

# Question 7
## Which of these elements had the highest sum in 2018?

Hint-  Select columns ‘Y2018’ and ‘Element’, Perform a groupby operation on ‘Element’ on the selected dataframe and answer
the  question.

In [28]:
high_sum = df.groupby("Element")["Y2018"].sum()
high_sum.sort_values(ascending=False)

Element
Domestic supply quantity                  2161192.10
Production                                2075072.89
Food                                      1303841.28
Total Population - Both sexes             1140605.00
Food supply (kcal/capita/day)              455261.00
Processing                                 308429.00
Import Quantity                            287997.09
Feed                                       233489.68
Export Quantity                            181594.80
Losses                                     163902.00
Other uses (non-food)                       91300.97
Food supply quantity (kg/capita/yr)         49056.85
Residuals                                   34864.00
Seed                                        25263.14
Stock Variation                             20577.91
Protein supply quantity (g/capita/day)      11833.56
Fat supply quantity (g/capita/day)          10258.69
Tourist consumption                            90.00
Name: Y2018, dtype: float64

# Question 8
## Which of these elements had the 3rd lowest sum in 2018?

Hint-  Select columns ‘Y2018’ and ‘Element’, Perform a groupby operation on ‘Element’ on the selected dataframe and answer the  question.

In [49]:
least_sum = df.groupby("Element")["Y2018"].sum()
least_sum = least_sum.sort_values().reset_index()
least_sum
#least_sum.iloc[2]

                                   Element       Y2018
0                      Tourist consumption       90.00
1       Fat supply quantity (g/capita/day)    10258.69
2   Protein supply quantity (g/capita/day)    11833.56
3                          Stock Variation    20577.91
4                                     Seed    25263.14
5                                Residuals    34864.00
6      Food supply quantity (kg/capita/yr)    49056.85
7                    Other uses (non-food)    91300.97
8                                   Losses   163902.00
9                          Export Quantity   181594.80
10                                    Feed   233489.68
11                         Import Quantity   287997.09
12                              Processing   308429.00
13           Food supply (kcal/capita/day)   455261.00
14           Total Population - Both sexes  1140605.00
15                                    Food  1303841.28
16                              Production  2075072.89
17                Domestic supply quantity  2161192.10

# Question 9
## What is the total Import Quantity in Algeria in 2018?

In [30]:
df.columns

Index(['Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [31]:
df.head(4)

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.0,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.9,94.35,94.72,92.82,91.83

In [32]:
import_df = df[['Area', "Element", 'Y2018']]
import_df.loc[(import_df['Area'] == "Algeria") & (import_df['Element'] == "Import Quantity")].sum()

Area       AlgeriaAlgeriaAlgeriaAlgeriaAlgeriaAlgeriaAlge...
Element    Import QuantityImport QuantityImport QuantityI...
Y2018                                               36238.29
dtype: object

# Question 10
## What is the total number of unique countries in the dataset?

In [33]:
df.Area.value_counts()

Kenya                          1560
Egypt                          1488
Nigeria                        1474
Côte d'Ivoire                  1467
Senegal                        1462
Cameroon                       1460
Uganda                         1458
Zambia                         1451
Malawi                         1447
Ethiopia                       1447
Madagascar                     1439
Mozambique                     1427
Rwanda                         1426
Angola                         1424
United Republic of Tanzania    1419
Congo                          1413
Guinea                         1410
Burkina Faso                   1409
Niger                          1403
South Africa                   1399
Zimbabwe                       1393
Morocco                        1393
Mauritius                      1378
Botswana                       1378
Ghana                          1354
Central African Republic       1344
Chad                           1343
Tunisia                        1338
Sudan                          1316
Algeria                        1313
Togo                           1294
Mali                           1293
Benin                          1285
Eswatini                       1284
Namibia                        1283
Cabo Verde                     1260
Gabon                          1245
Sierra Leone                   1242
Liberia                        1206
Mauritania                     1195
Sao Tome and Principe          1177
Gambia                         1168
Lesotho                        1150
Guinea-Bissau                  1128
Djibouti                       1095
Seychelles                       68
Sudan (former)                   53
Comoros                          45
Ethiopia PDR                     39
Name: Area, dtype: int64